// ////////////////////////////////////////////
//
// J_Boolean.java
// 
// 开发者:LoyaltyWu
// ////////////////////////////////////////////
// 简介：
// 			布尔运算短路规则例程
// ////////////////////////////////////////////
// 定义了一个J_Boolean类
public class J_Boolean 
{
	public static void main (String args[])
	{
		int month = 8;	//定义变量month,并赋初值 8
		int day = 1;		//定义变量day,并赋初值 1
		if((month == 8) || (++day<15)){
			System.out.print("Month="+month+", Day="+day);
		}
		if((month == 8) | (++day<15)){
			//这样就不采用短路规则
			System.out.print("Month="+month+", Day="+day);
		}
		//System.out.print("(o゜▽゜)o☆[BINGO!]");																			//用print就不会换行了
		
		//****************************************************************
		//***********************分界线***********************************
		//****************************************************************
		//2.3节 笔记
		int i = 5;					// 定义变量 i, 并赋初值 5
		int k = -i;					// 定义变量 k, 并赋初值 i 的相反数-5
		
		int i2 = 123456;		// 定义变量 i, 并赋初值 123456
		i2 = i2*i2;					// 进行乘操作
		
		double d = 3.1;
		d++;
		d--;
		
		int n = 3;
		int i3 = n++;				// i3=3,n=4
		int k = ++n;
		
		
		
	} // 方法 main 结束
} //类 J_Boolean 结束